#### DecimalSymbol Enumeration

---

|  |
| --- |
| See Also |

The symbol used to separate the integer and fractional parts of a number.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public enum DecimalSymbol ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration DecimalSymbol ``` |

| Visual C++ |
| --- |
| ``` public enum class DecimalSymbol ``` |

# Members

| Member name | Description |
| --- | --- |
| Dot | A dot ("."). |
| Comma | A comma (","). |

# See Also

Autodesk.Revit.DB Namespace